app/controllers/diagnosis_questions_controller.rb

  def index
    @diagnosis_questions = DiagnosisQuestion.all.order(:display_order)
---
SELECT "diagnosis_questions".* FROM "diagnosis_questions" ORDER BY "diagnosis_questions"."display_order" ASC