app/controllers/diagnoses_controller.rb

SELECT "diagnosis_options".* FROM "diagnosis_options" WHERE "diagnosis_options"."diagnosis_question_id" = 1 ORDER BY "diagnosis_options"."display_order" ASC
SELECT "diagnosis_questions".* FROM "diagnosis_questions" ORDER BY "diagnosis_questions"."display_order" ASC
---
  def index
    @diagnoses = DiagnosisQuestion.includes(:diagnosis_options).order(:display_order)