app/views/diagnosis_questions/index.html.erb


      <% question.diagnosis_options.order(:display_order).each do |option| %>
---
SELECT "diagnosis_options".* FROM "diagnosis_options" WHERE "diagnosis_options"."diagnosis_question_id" = 5 ORDER BY "diagnosis_options"."display_order" ASC